/*
OO 연구소는 한 번에 K 칸을 앞으로 점프하거나, (현재까지 온 거리) x 2 에 해당하는 위치로 순간이동을 할 수 있는 특수한 기능을 가진 아이언 슈트를 개발하여 판매하고 있습니다. 이 아이언 슈트는 건전지로 작동되는데, 순간이동을 하면 건전지 사용량이 줄지 않지만, 앞으로 K 칸을 점프하면 K 만큼의 건전지 사용량이 듭니다. 그러므로 아이언 슈트를 착용하고 이동할 때는 순간 이동을 하는 것이 더 효율적입니다. 아이언 슈트 구매자는 아이언 슈트를 착용하고 거리가 N 만큼 떨어져 있는 장소로 가려고 합니다. 단, 건전지 사용량을 줄이기 위해 점프로 이동하는 것은 최소로 하려고 합니다. 아이언 슈트 구매자가 이동하려는 거리 N이 주어졌을 때, 사용해야 하는 건전지 사용량의 최솟값을 return하는 solution 함수를 만들어 주세요.
예를 들어 거리가 5만큼 떨어져 있는 장소로 가려고 합니다.
아이언 슈트를 입고 거리가 5만큼 떨어져 있는 장소로 갈 수 있는 경우의 수는 여러 가지입니다.
처음 위치 0 에서 5 칸을 앞으로 점프하면 바로 도착하지만, 건전지 사용량이 5 만큼 듭니다.
처음 위치 0 에서 2 칸을 앞으로 점프한 다음 순간이동 하면 (현재까지 온 거리 : 2) x 2에 해당하는 위치로 이동할 수 있으므로 위치 4로 이동합니다. 이때 1 칸을 앞으로 점프하면 도착하므로 건전지 사용량이 3 만큼 듭니다.
처음 위치 0 에서 1 칸을 앞으로 점프한 다음 순간이동 하면 (현재까지 온 거리 : 1) x 2에 해당하는 위치로 이동할 수 있으므로 위치 2로 이동됩니다. 이때 다시 순간이동 하면 (현재까지 온 거리 : 2) x 2 만큼 이동할 수 있으므로 위치 4로 이동합니다. 이때 1 칸을 앞으로 점프하면 도착하므로 건전지 사용량이 2 만큼 듭니다.
위의 3가지 경우 거리가 5만큼 떨어져 있는 장소로 가기 위해서 3번째 경우가 건전지 사용량이 가장 적으므로 답은 2가 됩니다.
제한 사항
숫자 N: 1 이상 10억 이하의 자연수
숫자 K: 1 이상의 자연수
*/

function solution(n)
{
    let count=0;
    var ans = n;
    while(ans>0){
        if(ans%2===0){
          ans=ans/2;
        }else{
          ans--;
            count++;
        }
    }


    return count;
}


/*
학생식당에서는 매일 여러 종류의 메뉴를 판매한다. 학생식당 관리자는 하루 동안 어떤 메뉴가 가장 많이 주문되었는지 확인하여, 다음 날 식단 구성에 참고하려고 한다. 
메뉴는 1번부터 M번까지의 번호로 구분된다. 하루 동안 총 N개의 주문 기록이 주어지며, 각 주문 기록에는 학생이 주문한 메뉴 번호가 하나씩 적혀 있다.
관리자는 이 주문 기록을 바탕으로 가장 많이 주문된 메뉴를 인기 메뉴로 선정하려고 한다. 
단, 가장 많이 주문된 횟수가 같은 메뉴가 여러 개 있을 수 있다. 이 경우에는 메뉴 번호가 작은 메뉴를 인기 메뉴로 선정한다. 
하루 동안의 주문 기록이 주어졌을 때, 인기 메뉴의 번호를 출력하는 프로그램을 작성하시오. 입력 첫째 줄에 주문 기록의 수 N과 메뉴의 개수 M이 공백으로 구분되어 주어진다. 
둘째 줄에 하루 동안 주문된 N개의 메뉴 번호가 공백으로 구분되어 주어진다. 
출력 가장 많이 주문된 메뉴의 번호를 출력한다. 가장 많이 주문된 메뉴가 여러 개라면, 그중 번호가 가장 작은 메뉴의 번호를 출력한다.
*/

const [n,m] = a.split(" ");
const orderList = b.split(" ");
let orderCounts = new Array(m).fill(0);

for(order of orderList){
  orderCounts [Number(order)-1]=++orderCounts [Number(order)-1];
}

const orderMax = Math.max(...orderCounts)
const result = orderCounts.findIndex(order=> order===orderMax)+1
